src/QuanLyDiaChiComApp/test/GetListHuyen/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quan="QuanLyDiaChiComApp">
  <soapenv:Body>
    <quan:LayDanhSachHuyenOperation>
      <idTinh>249</idTinh>
    </quan:LayDanhSachHuyenOperation>
  </soapenv:Body>
</soapenv:Envelope>